{
  "version": "20250721",
  "current": {
    "workplace": "Olo",
    "workplaceUrl": "https://www.olo.com",
    "start": "June 17, 2019",
    "description": "Olo is a product-focused SaaS company with a large enterprise offering that facilitates many aspects of restaurant business operations and food ordering.",
    "roles": [
      {
        "title": "Staff Software Engineer",
        "start": "July 6, 2023",
        "outcomes": [
          "Led a small team in the development of Olo's now-standardized design system software library, a culmination of years of work that started as a passion project attempting to solve the problem of inconsistent UI across our customer-facing applications.",
          "Provided technical and organizational leadership to the Front End Foundations team, including creating and refining our ticketed work, capturing data on support efforts, providing updates and transparency on our goals and objectives, and leading sprint reviews, demos, and retrospectives.",
          "Architected a unified vendor selection tool based on a standardized data model that is used across the entire customer-facing application suite, allowing for a consistent and efficient experience for our brands when configuring their vendors tools and workflows.",
          "Provided best-practices, cross-functional communication, and technical leadership to the second Catering team at Olo, where I am responsible for guiding our technical efforts to expand our rapidly growing catering product offerings."
        ]
      },
      {
        "title": "Senior Software Engineer II",
        "start": "Jan 1, 2021",
        "end": "July 5, 2023",
        "outcomes": [
          "Architected a front-end monorepo to house our internal administrative tooling UIs, allowing for shared code and a more consistent developer experience across teams.",
          "Mentored teammates and coworkers in both a formal and informal capacity, in career and front-end development best practices.",
          "Led the development of several key features in our customer onboarding workflows, including a new store opening experience that allowed our brand-level customers to move away from using a spreadsheet to maintain their vendor configurations and instead provided efficiency, consistency, and integrity of experience as well as a more transparent and robust reporting structure.",
          "Worked to transition our design system software library from a grassroots effort to an officially sanctioned product used by teams across Olo to build both internal and customer-facing interfaces.",
          "Migrated design system components from a legacy React-only implementation to a set of modern Web Components using the Lit framework, affording our legacy applications the ability to modernize their UI without needing to rewrite their entire codebase."
        ]
      },
      {
        "title": "Senior Software Engineer I",
        "start": "June 17, 2019",
        "end": "Dec 31, 2020",
        "outcomes": [
          "Built solutions for a wide range of application surfaces, including consumer-facing ordering interfaces, B2B customer dashboards, and internal administrative tools.",
          "Led the ideation, development, documentation, and advocacy of a new grassroots design system software library for Olo with a designer and one other engineer, providing a level of consistency not previously attainable in our customer-facing dashboard applications.",
          "Worked closely with engineering, product, and design organizations to ensure that the design system met the needs of our customers and internal teams as well as providing a more robust and efficient front-end development lifecycle."
        ]
      }
    ]
  },
  "skills": [
    {
      "skill": "Languages",
      "skills": ["JavaScript", "TypeScript", "C#", "HTML", "CSS", "Bash", "Powershell", "C++", "PHP"]
    },
    {
      "skill": "Frameworks / Libraries / APIs",
      "skills": ["Web Components", "Lit", "Shoelace", "React", "Redux", "jQuery", "Node"]
    },
    {
      "skill": "Programs / Build Tooling / Other",
      "skills": ["NPM", "Git", "Webpack", "Vite", "Chrome Developer Tools"]
    },
    {
      "skill": "Testing",
      "skills": ["Playwright", "Vitest", "Jest", "NUnit", "Selenium", "k6", "Chai", "Sinon"]
    },
    {
      "skill": "Data / Storage / Messaging",
      "skills": ["MSSQL", "MySQL", "PostgreSQL", "Looker", "DataDog", "SumoLogic", "AWS S3", "AWS SQS", "Kafka"]
    },
    {
      "skill": "Cloud / DevOps",
      "skills": ["Docker", "Kubernetes", "AWS EKS", "Terraform", "TeamCity", "Octopus", "GitHub Actions"]
    }
  ],
  "community": [
    {
      "title": "Olo internal tech talk organizer",
      "date": "January 2024 - present",
      "description": "At Olo, I actively lead efforts to organize and deliver regularly scheduled internal tech talks, lightning talk sessions, and panel discussions. I collaborate with engineers and cross-functional partners in leadership and employee resource groups to ensure consistency and visibility, coordinate upcoming presentations, prepare speakers, and research relevant topics and platforms to support continuous learning and knowledge sharing across the organization."
    },
    {
      "title": "Organizer - Rockford Web Devs",
      "date": "December 2013 - January 2018",
      "description": "I helped organize the Rockford Web Devs meetup group for five years, creating a welcoming space for developers of all skill levels to share their work, exchange ideas, and improve their craft. I took an active role in planning and promoting events, recruiting speakers, curating diverse and relevant topics, and fostering community engagement. Although we explored a wide variety of software development topics—including .NET, Golang, and embedded systems—we primarily focused on the practical use of PHP, JavaScript, HTML, and CSS for building web applications. Through these efforts, I worked to build a collaborative and supportive environment for professional growth and technical learning."
    },
    {
      "title": "Mentor - Thinkful",
      "date": "July 2015 - July 2017",
      "description": "At Thinkful, I mentored students one-on-one in a Front End Web Development course, guiding them from little or no prior programming experience to a level of proficiency suitable for junior developer roles. I provided personalized instruction on core web technologies, including HTML, CSS, and JavaScript, while also teaching practical skills such as using the jQuery library and integrating external data through AJAX. Beyond technical instruction, I supported students in developing problem-solving strategies, building confidence, and preparing for real-world development environments. My mentorship focused on equipping students with both the technical foundation and the mindset needed to succeed in their transition into the tech industry."
    },
    {
      "title": "Maintaining a Local Developer Meetup",
      "date": "May 29, 2015",
      "location": "JSConf US",
      "video": "https://www.youtube.com/watch?v=1pBxxuxvCjU",
      "slides": "http://jacobroufa.github.io/jsconf-2015-meetup",
      "description": "I gave a talk on my experience organizing a developer meetup, sharing what the role meant to me and the impact it had on building community. I outlined practical strategies for improving outreach, including clear communication, consistent scheduling, and creating a welcoming environment. Drawing from my work with Rockford Web Devs and lessons learned along the way, I offered actionable insights other organizers could use to grow and strengthen their own local tech communities."
    },
    {
      "title": "Building and Consuming RESTful APIs",
      "date": "April 2015",
      "location": "Rockford Web Devs and Chicago Code Camp",
      "slides": "http://lostriverweb.com/rest-presentation",
      "description": "I delivered a presentation on the principles of REST in the context of modern web development. I demonstrated how to build a simple API using PHP and the Slim Framework, and then showed how to consume that API with a JavaScript front end built using Backbone.js. Through practical examples, I highlighted how RESTful architecture supports clean, maintainable, and scalable application design."
    },
    {
      "title": "Staff - FreeGeek Chicago",
      "date": "2008",
      "location": "Chicago, IL",
      "description": "I volunteered at FreeGeek Chicago, a non-profit organization dedicated to refurbishing donated computers for low-income families. I actively contributed to the refurbishment process, repairing and preparing hardware for reuse. I also taught classes on how to process and refurbish computer donations, and introduced participants to using Linux and other open source software, helping to empower them with practical technical skills."
    }
  ],
  "past": [
    {
      "workplace": "Clinton Electronics",
      "workplaceUrl": "https://www.clintonelectronics.com/",
      "start": "November 2017",
      "end": "June 2019",
      "description": "Clinton Electronics is a small manufacturing company that specializes in building modern, customizable security appliances and theft deterrents.",
      "roles": [
        {
          "title": "Lead Front-End Developer",
          "outcomes": [
            "Architected and built an administrative dashboard used by our customers to tailor their experience with Clinton's latest generation of PVM security appliance, for adding digital signage and theft deterrence often used in a retail setting.",
            "Worked closely with back-end and appliance firmware engineers to integrate the front-end application with the underlying hardware and services, ensuring a seamless user experience.",
            "Led the development of multiple features related to PVM configuration, including user management, dynamic content layout and scheduling, and device monitoring.",
            "Used technologies including React, Redux, TypeScript, Ant Design library, and Webpack to build a modern, responsive, and maintainable front-end application.",
            "Spearheaded the adoption of modern front-end development practices, including code reviews, pair programming, and knowledge sharing within the team.",
            "Implemented automated testing, static analysis, and continuous integration workflows to ensure code quality and reliability."
          ]
        }
      ]
    },
    {
      "workplace": "SitePen",
      "workplaceUrl": "https://www.sitepen.com/",
      "start": "November 2015",
      "end": "June 2017",
      "description": "SitePen is a professional services company that specializes in building web applications and providing training and support for the Dojo Toolkit and related open source projects. They are known for their expertise in JavaScript and their contributions to the open source community.",
      "roles": [
        {
          "title": "Software Engineer",
          "outcomes": [
            "Worked on projects for a variety of clients including internal administrative software for Marriott Hotels and the front-end component framework used by Intuit to develop their public-facing applications.",
            "Contributed to the Dojo Toolkit by implementing new features, fixing bugs, and improving documentation."
          ]
        }
      ]
    },
    {
      "workplace": "Quiet Light Communications",
      "workplaceUrl": "https://www.quietlightcom.com/",
      "start": "June 2014",
      "end": "November 2015",
      "description": "Quiet Light Communications is a B2B agency that specializes in building websites and applications for clients in the food production industry. They focus on creating custom print, audiovisual, and web-based solutions that meet the unique needs of their clients.",
      "roles": [
        {
          "title": "Interactive Developer",
          "outcomes": [
            "Developed custom business websites and mobile applications, specializing in building a complete front-end experience, for clients such as the American Egg Board and Taylor Freezer.",
            "Maintained infrastructure and build tooling to improve the in-house development experience with ExpressionEngine CMS and jQuery UI."
          ]
        }
      ]
    },
    {
      "workplace": "FatWallet",
      "workplaceUrl": "https://www.rakuten.com/",
      "start": "June 2013",
      "end": "June 2014",
      "description": "FatWallet was a community-driven website focused on helping consumers save money through cash back, coupons, and deals.",
      "roles": [
        {
          "title": "Software Engineer",
          "description": "I worked primarily on tools to manage content and reporting with a team of a dozen software engineers. As an engineering team with a large product focus we built features, maintained current website infrastructure, developed web browser extensions and internal administrative reporting tools.",
          "outcomes": [
            "Maintained and built new features for the FatWallet website within a legacy codebase using PHP and JavaScript.",
            "Worked on coupon analysis and reporting tools during the busy Black Friday and Cyber Monday seasons.",
            "Developed Apache Solr search integration for the FatWallet website using the Ebates CBSP platform, improving search functionality and performance."
          ]
        }
      ]
    },
    {
      "workplace": "Rockford Register Star",
      "workplaceUrl": "https://www.rrstar.com/",
      "start": "May 2012",
      "end": "June 2013",
      "description": "The Rockford Register Star is the newspaper of record for the Rockford, IL area. During my tenure there I held multiple roles, working with the website infrastructure, online advertisement, and the newsroom to build interactive projects and databases.",
      "roles": [
        {
          "title": "Digital Specialist",
          "start": "September 2012",
          "end": "June 2013",
          "outcomes": [
            "Maintained and updated a local server for hosting interactive projects and integrating with the infrastructure our parent company provided.",
            "Coordinated with the newsroom to build digital interactive projects and databases for reporters.",
            "Special projects included: Election results coverage in 2012 and 2013, a database of regional school report cards updated annually, databases and visualisations of local special interest groups and crime statistics"
          ]
        },
        {
          "title": "Webmaster",
          "workplace": "Rockford Register Star",
          "workplaceUrl": "https://www.rrstar.com/",
          "start": "May 2012",
          "end": "September 2012",
          "outcomes": [
            "Worked on website infrastructure and content management system (CMS) administration.",
            "Managed online advertisement, including ad placement, tracking, and reporting."
          ]
        }
      ]
    },
    {
      "workplace": "Independent Consultant",
      "start": "April 2008",
      "end": "November 2017",
      "description": "As an independent consultant and software developer for hire I developed software solutions using a variety of technologies including JavaScript / React & VueJS, Ruby on Rails, and PHP / WordPress.\n\nSome clients included:",
      "roles": [
        {
          "title": "The Galecia Group",
          "start": "October 2010",
          "end": "October 2017",
          "description": "A consulting firm focused on strategic implementation of technology to benefit libraries and librarians. I worked with them on a variety of website and database development projects.",
          "outcomes": [
            "Conducted maintenance and development of several Drupal websites including theme development, browser testing, and administration.",
            "Helped redesign and rebuild the Southern California Library Cooperative's website and online infrastructure. This included migrating between major Drupal releases, creating a database to replace an outdated system of Google Spreadsheets, and integrating more informative Library profiles.",
            "Worked on the Atlas of Historical County Boundaries: a project led by research historians at the Newberry Library in Chicago, IL to build an interactive map of county borders from their historical roots to present day. Technologies used included Leaflet JS and CartoDB to store GeoJSON data and render it in a web browser."
          ]
        },
        {
          "title": "Brazas Law",
          "start": "May 2014",
          "end": "February 2015",
          "description": "Created a website for a small law firm in Rockford, IL built with Wordpress implementing a fully responsive design. Additionally consulted about email campaigns as well as website analytics and traffic."
        },
        {
          "title": "Insane Enterprises",
          "start": "May 2010",
          "end": "June 2013",
          "description": "Personal projects of entrepreneur Brandon Fletcher, the first person to conduct a revenue sharing deal with YouTube before they launched their partner program to the general public in 2007.",
          "outcomes": [
            "Rebuilt the website for DateUnknown, an online comedy dating show, in 2010. This included upgrading to Drupal 6, modernizing UI with new and updated designs, and adding features related to the video production.",
            "Prototyped The Brandon Academy, a music tutorial aggregator, in early 2012.",
            "Took on webmaster duties for the personal website of Chanel Iman, a fashion model and friend of Brandon's, throughout 2012."
          ]
        },
        {
          "title": "The Richard H. Driehaus Foundation",
          "start": "July 2009",
          "end": "July 2012",
          "description": "Provided regular maintenance of a Chicago-based philanthropic organization, which during my tenure included major security and platform upgrades. Originally a Chicago Technology Cooperative client."
        },
        {
          "title": "Progress Illinois",
          "start": "November 2011",
          "end": "May 2012",
          "description": "Provided regular maintenance and new development to maintain and operate a news website focused on progressive Illinois and Chicago politics."
        },
        {
          "title": "The Adjusted Webcomic",
          "start": "September 2010",
          "end": "December 2010",
          "description": "Worked with the creator of a comic called The Adjusted to build a new website using Drupal to host dynamic and paid content as well as multiple media forms, expanding their vision and platform reach. The site was built to allow for easy updates and maintenance by the creator and included a custom theme, integrated HTML5 video, dynamic character bios, and a shopping cart experience for facilitating download of protected content."
        },
        {
          "title": "District 300, Carpentersville, IL",
          "start": "April 2008",
          "end": "September 2008",
          "description": "Worked with the Illinois public school district #300 to migrate their website from a proprietary CMS to use the Drupal content management system. This included migrating content, building a new theme, creating an integral FOIA system, and brainstorming and pioneering a new type of module in the Drupal ecosystem called Publish Content."
        }
      ]
    },
    {
      "workplace": "Chicago Technology Cooperative",
      "start": "March 2007",
      "end": "April 2008",
      "description": "Chicago Tech was a small web development agency focused on building websites and applications for non-profit organizations. As my first job working on the web I focused primarily on administrative interface customizations and content administration.",
      "roles": [
        {
          "title": "Content Specialist",
          "outcomes": [
            "Built Drupal websites via administrative interface, made template and stylesheet customizations.",
            "Worked with our account managers to recommend solutions and refine customer expectations.",
            "Learned the basics of HTML, CSS, JavaScript, and PHP within the context of a Drupal application."
          ]
        }
      ]
    }
  ]
}
