{
  "version": "20250519",
  "current": {
    "workplace": "Olo",
    "workplaceUrl": "https://www.olo.com",
    "start": "June 17, 2019",
    "description": "Olo is a product-focused SaaS company with a large enterprise offering that facilitates many aspects of restaurant business operations and food ordering.",
    "roles": [
      {
        "title": "Staff Software Engineer",
        "start": "July 6, 2023",
        "description": "In the lead up to my promotion to Staff Engineer, I began work (at the end of 2022) on our newly formed Front End Foundations team to lead the development of a software library of web components based upon our design system UI. This was ultimately the culmination of years of work that started as a grass-roots project within the company before being sanctioned and officially introduced as a core internal product used by teams across Olo to build our internal and customer-facing configuration software UI. As my role progressed I also took lead on work sprint organization based around Scrum principles, working to organize and refine our ticketed work, capture data about support efforts, provide updates to the organization around our goals and objectives, and lead sprint reviews and retrospectives.",
        "skills": []
      },
      {
        "title": "Senior Software Engineer II",
        "start": "Jan 1, 2021",
        "end": "July 5, 2023",
        "description": "As SSE2 at Olo my work is primarily set in our Admin & Onboarding environment, where I am responsible for helping to maintain our largest internal application as well as architecting and automating our customer Onboarding workflows. Our Admin software is used daily by everyone across the company, and modified regularly by nearly every engineering team. Using our company's internal design system software and modern front-end monorepo architecture, I work diligently on pushing our applications towards modern implementation and best practices in architecture and developer experience.",
        "skills": []
      },
      {
        "title": "Senior Software Engineer I",
        "start": "June 17, 2019",
        "end": "Dec 31, 2020",
        "description": "At Olo, as a SSEI, I worked on front-end applications ranging from direct consumer ordering to B2B customer dashboard software and internal administrative workflows. I specialized in React/Typescript front-end bootstrapping and migration. Helped ideate, implement, evangelize and build a modern front-end design system software to unify customer facing application user experiences.",
        "skills": []
      }
    ]
  },
  "community": [
    {
      "title": "Olo internal tech talk organizer",
      "date": "January 2024 - present",
      "description": "Internally to Olo, I work with engineers and other folks to present tech talks on a weekly basis, to provide consistency and discoverability to these talks, organize future presentations, prepare presenters, research potential outlets and topics, and more."
    },
    {
      "title": "Organizer - Rockford Web Devs",
      "date": "December 2013 - January 2018",
      "description": "I help organize the Rockford Web Devs meetup group, where devs of all skill levels are encouraged to come share their work and learn how to better their craft. We share on a diverse set of topics but focus mainly on using PHP, JavaScript, HTML and CSS as a toolset."
    },
    {
      "title": "Mentor - Thinkful",
      "date": "July 2015 - July 2017",
      "description": "At Thinkful, I mentor students one-on-one in a Front End Web Development course, helping them go from little to no prior development knowledge to preparedness for a junior developer role, should they choose to pursue that career path. I teach HTML, CSS and JavaScript fundamentals, as well as making use of the jQuery library and learning about integrating external API data using AJAX."
    },
    {
      "title": "Maintaining a Local Developer Meetup",
      "date": "May 29, 2015",
      "location": "JSConf US",
      "video": "https://www.youtube.com/watch?v=1pBxxuxvCjU",
      "slides": "http://jacobroufa.github.io/jsconf-2015-meetup",
      "description": "I present on what it means to me to help organize a meetup, and share techniques other organizers might be able to use for a better outreach in their communities."
    },
    {
      "title": "Building and Consuming RESTful APIs",
      "date": "April 2015",
      "location": "Rockford Web Devs and Chicago Code Camp",
      "slides": "http://lostriverweb.com/rest-presentation",
      "description": "I present on the principles of REST in a modern web development context. I show how to build a simple API with PHP and the Slim Framework, and then how to consume that API using a JavaScript front-end with Backbone.js."
    },
    {
      "title": "Staff - FreeGeek Chicago",
      "date": "2008",
      "location": "Chicago, IL",
      "description": "I volunteered at FreeGeek Chicago, a non-profit organization that takes in old computers and refurbishes them for use by low-income families. I helped with the refurbishment process and teaching classes on how to process and refurbish donations as well as using Linux and other open source software."
    }
  ],
  "past": [
    {
      "workplace": "Clinton Electronics",
      "workplaceUrl": "https://www.clintonelectronics.com/",
      "start": "November 2017",
      "end": "June 2019",
      "roles": [
        {
          "title": "Lead Front-End Developer",
          "description": "I led a small team of engineers in developing a React dashboard application written in Typescript using Ant Design framework as a counterpart and control system for a custom android appliance. I specialized in front-end application architecture and succeeded in launching multiple complex features during my tenure.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "SitePen",
      "workplaceUrl": "https://www.sitepen.com/",
      "start": "November 2015",
      "end": "June 2017",
      "roles": [
        {
          "title": "Software Engineer",
          "description": "As a software engineer at SitePen, I work on a team of talented engineers building applications, providing support and training for JavaScript, the Dojo Toolkit and related open source projects. I sometimes write blog posts about conferences I attend.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "Quiet Light Communications",
      "workplaceUrl": "https://www.quietlightcom.com/",
      "start": "June 2014",
      "end": "November 2015",
      "roles": [
        {
          "title": "Interactive Developer",
          "description": "At Quiet Light, I work on a team of three other developers to build client websites and mobile applications. I specialize in building a complete front-end experience, utilizing the ExpressionEngine CMS, leveraging technologies like JavaScript and implementing a fully responsive design. I also build tooling using the Grunt framework to better assist our development cycle, and work server-side with both JavaScript and PHP on a regular basis. I have spearheaded web development on diverse projects such as AC Horn Manufacturing and the Taylor Company MagnaBlend.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "FatWallet",
      "workplaceUrl": "https://www.rakuten.com/",
      "start": "June 2013",
      "end": "June 2014",
      "roles": [
        {
          "title": "Software Engineer",
          "description": "I work with a team of other software engineers to build features and maintain current website infrastructure, as well as work on projects not limited to but including iOS and Android apps, web browser extensions and administrative reporting tools used internally for FatWallet and our sister properties.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "Rockford Register Star",
      "workplaceUrl": "https://www.rrstar.com/",
      "start": "May 2012",
      "end": "June 2013",
      "description": "The Rockford Register Star is the newspaper of record for the Rockford, IL area. During my tenure there I held multiple roles, working with the website infrastructure, online advertisement, and the newsroom to build interactive projects and databases.",
      "roles": [
        {
          "title": "Digital Specialist",
          "start": "September 2012",
          "end": "June 2013",
          "description": "I work with the newsroom building digital interactive projects and databases for our reporters to use. I also handle most things related to the website and online properties at the GateHouse Media-owned Northern Illinois regional newspaper.",
          "skills": []
        },
        {
          "title": "Webmaster",
          "workplace": "Rockford Register Star",
          "workplaceUrl": "https://www.rrstar.com/",
          "start": "May 2012",
          "end": "September 2012",
          "description": "I handle most things related to the website, online properties and online advertisement at the GateHouse Media-owned Northern Illinois regional newspaper.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "Independent Consultant",
      "start": "April 2008",
      "end": "November 2017",
      "description": "As an independent consultant and software developer for hire I worked with companies such as Whiplash and Mindsize developing solutions using JavaScript / React & VueJS, Ruby on Rails, and PHP / WordPress.",
      "roles": [
        {
          "title": "The Galecia Group",
          "start": "October 2010",
          "end": "October 2017",
          "description": "Much of my early work involved regular maintenance and new development if needed of several Drupal websites -- theme work, browser testing and administrivia mostly. As my work with the Galecia Group expanded, I worked on projects ranging from the redesign and re-build of the Southern California Library Cooperative's website and online infrastructure, to the Atlas of Historical County Boundaries, a project working in conjunction with several research historians at the Newberry Library in Chicago, IL to build an interactive map of county borders from their historical roots to present day.",
          "skills": []
        },
        {
          "title": "Brazas Law",
          "start": "May 2014",
          "end": "February 2015",
          "description": "I worked with Susan Brazas, a Rockford, IL attorney, to develop a website for her practice. I have consulted with her about email and analytics as well. Website was built with Wordpress and implements a fully responsive design.",
          "skills": []
        },
        {
          "title": "Insane Enterprises",
          "start": "May 2010",
          "end": "June 2013",
          "description": "Go-to web guy for Insane Enterprises. Rebuilt the website for DateUnknown, an online comedy dating show, in 2010 updating to Drupal 6 and modernizing UI. Added features and mildly customized UX. Built PumpCoach, an automated workout pal, in 2011 using Drupal 6. An interesting experience in getting the User system in Drupal to do strange things, to say the least. Prototyped The Brandon Academy, a music tutorial aggregator, in early 2012.",
          "skills": []
        },
        {
          "title": "Rockford Area Habitat for Humanity",
          "start": "October 2012",
          "end": "February 2013",
          "description": "Working with the Habitat staff, I designed and built a new website for them using the Drupal content management system. Unfortunately due to time constraints I had to pass the project off to be finished by V2 Communications, a local web development shop in Rockford, IL.",
          "skills": []
        },
        {
          "title": "Lead Developer",
          "workplace": "The Richard H. Driehaus Foundation",
          "workplaceUrl": "https://driehausfoundation.org/",
          "start": "July 2009",
          "end": "July 2012",
          "description": "Regular maintenance on a simple Drupal 6 website. I upgraded the website and theme from Drupal 5 mid-2010. Originally a Chicago Technology Cooperative client.",
          "skills": []
        },
        {
          "title": "Progress Illinois",
          "start": "November 2011",
          "end": "May 2012",
          "description": "Regular maintenance, new development and on-call web dude. It's my job to make sure the site stays running and to develop new features.",
          "skills": []
        },
        {
          "title": "Southern California Library Cooperative",
          "workplaceUrl": "https://www.socallibraries.org/",
          "start": "October 2010",
          "end": "May 2012",
          "description": "Rebuilding old site (D5) in Drupal 6 with heavy Views and several thousand imported nodes. Created database to replace system of Google Docs' Spreadsheets and integrate with more informative Library profiles. Created new theme based on rough mock-ups given by client.",
          "skills": []
        },
        {
          "title": "The Adjusted Webcomic",
          "start": "September 2010",
          "end": "December 2010",
          "description": "Developed a Drupal 6 website from conception using rough mockups given by client. Integrated HTML5 video, dynamic character bios and shopping cart experience are main features of the site.",
          "skills": []
        },
        {
          "title": "Just1",
          "start": "April 2009",
          "end": "July 2009",
          "description": "Facilitated several Drupal projects. Available for other Drupal administrivia and theming.",
          "skills": []
        },
        {
          "title": "District 300, Carpentersville, IL",
          "workplaceUrl": "https://www.d300.org/",
          "start": "April 2008",
          "end": "September 2008",
          "description": "Helped stage a move from a proprietary PHP CMS to Drupal. Minor Views work, integral FOIA system, brainstormed and pioneered the Publish Content module.",
          "skills": []
        }
      ]
    },
    {
      "workplace": "Chicago Technology Cooperative",
      "start": "March 2007",
      "end": "April 2008",
      "roles": [
        {
          "title": "Content Specialist",
          "description": "Started as an intern, quickly learning about the many facets of Drupal administrivia. This is where I got my start on the web. Many thanks to ALL the CTC folks who helped form my wonderful career on the web.",
          "skills": []
        }
      ]
    }
  ],
  "skills": [
    {
      "skill": "Languages",
      "skills": [ "JavaScript", "TypeScript", "C#", "C++", "HTML", "CSS", "LESS", "PHP", "Bash", "Powershell" ]
    },
    {
      "skill": "Frameworks / Libraries / APIs",
      "skills": [ "Web Components", "Lit", "Shoelace", "Playwright", "React", "Redux", "Ant Design", "RxJS", "Node", "Laravel", "Intern", "Chai", "Enzyme", "Sinon", "VueJS", "WordPress", "Dojo", "Dojo 2", "jQuery", "Slim Framework" ]
    },
    {
      "skill": "Programs / Build Tooling / Other",
      "skills": [ "Vim", "NPM", "Git", "Webpack", "Vite", "Chrome Developer Tools", "Babel", "Composer", "AMD/RequireJS", "Grunt" ]
    }
  ]
}
